STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
#define SPI4                        SPI4_NS
#define SPI4_BASE                   SPI4_BASE_NS

#define TIM15                       TIM15_NS
#define TIM15_BASE                  TIM15_BASE_NS

#define TIM16                       TIM16_NS
#define TIM16_BASE                  TIM16_BASE_NS

#define TIM17                       TIM17_NS
#define TIM17_BASE                  TIM17_BASE_NS

#define SPI5                        SPI5_NS
#define SPI5_BASE                   SPI5_BASE_NS

#define SAI1                        SAI1_NS
#define SAI1_BASE                   SAI1_BASE_NS

#define SAI1_Block_A                SAI1_Block_A_NS
#define SAI1_Block_A_BASE           SAI1_Block_A_BASE_NS

#define SAI1_Block_B                SAI1_Block_B_NS
#define SAI1_Block_B_BASE           SAI1_Block_B_BASE_NS

#define SAI2                        SAI2_NS
#define SAI2_BASE                   SAI2_BASE_NS

#define SAI2_Block_A                SAI2_Block_A_NS
#define SAI2_Block_A_BASE           SAI2_Block_A_BASE_NS

#define SAI2_Block_B                SAI2_Block_B_NS
#define SAI2_Block_B_BASE           SAI2_Block_B_BASE_NS

#define SAI3                        SAI3_NS
#define SAI3_BASE                   SAI3_BASE_NS

#define SAI3_Block_A                SAI3_Block_A_NS
#define SAI3_Block_A_BASE           SAI3_Block_A_BASE_NS

#define SAI3_Block_B                SAI3_Block_B_NS
#define SAI3_Block_B_BASE           SAI3_Block_B_BASE_NS


#define USART1                      USART1_NS
#define USART1_BASE                 USART1_BASE_NS

#define SAI4                        SAI4_NS
#define SAI4_BASE                   SAI4_BASE_NS

#define SAI4_Block_A                SAI4_Block_A_NS
#define SAI4_Block_A_BASE           SAI4_Block_A_BASE_NS

#define SAI4_Block_B                SAI4_Block_B_NS
#define SAI4_Block_B_BASE           SAI4_Block_B_BASE_NS


#define UART7                       UART7_NS
#define UART7_BASE                  UART7_BASE_NS


/*!< AHB2 peripherals defaults to Non secure aliases */
#define HPDMA1                      HPDMA1_NS
#define HPDMA1_BASE                 HPDMA1_BASE_NS

#define HPDMA2                      HPDMA2_NS
#define HPDMA2_BASE                 HPDMA2_BASE_NS

#define HPDMA3                      HPDMA3_NS
#define HPDMA3_BASE                 HPDMA3_BASE_NS

#define OCTOSPI1                    OCTOSPI1_NS
#define OCTOSPI1_BASE               OCTOSPI1_BASE_NS

#define OTFDEC1                     OTFDEC1_NS
#define OTFDEC1_BASE                OTFDEC1_BASE_NS

#define OTFDEC1_REGION1             OTFDEC1_REGION1_NS
#define OTFDEC1_REGION1_BASE        OTFDEC1_REGION1_BASE_NS

#define OTFDEC1_REGION2             OTFDEC1_REGION2_NS
#define OTFDEC1_REGION2_BASE        OTFDEC1_REGION2_BASE_NS

#define OTFDEC1_REGION3             OTFDEC1_REGION3_NS
#define OTFDEC1_REGION3_BASE        OTFDEC1_REGION3_BASE_NS

#define OTFDEC1_REGION4             OTFDEC1_REGION4_NS
#define OTFDEC1_REGION4_BASE        OTFDEC1_REGION4_BASE_NS

#define OTFDEC2                     OTFDEC2_NS
#define OTFDEC2_BASE                OTFDEC2_BASE_NS

#define OTFDEC2_REGION1             OTFDEC2_REGION1_NS
#define OTFDEC2_REGION1_BASE        OTFDEC2_REGION1_BASE_NS

#define OTFDEC2_REGION2             OTFDEC2_REGION2_NS
#define OTFDEC2_REGION2_BASE        OTFDEC2_REGION2_BASE_NS

#define OTFDEC2_REGION3             OTFDEC2_REGION3_NS
#define OTFDEC2_REGION3_BASE        OTFDEC2_REGION3_BASE_NS

#define OTFDEC2_REGION4             OTFDEC2_REGION4_NS
#define OTFDEC2_REGION4_BASE        OTFDEC2_REGION4_BASE_NS
#define ICACHE                      ICACHE_NS
#define ICACHE_BASE                 ICACHE_BASE_NS

#define DCACHE                      DCACHE_NS
#define DCACHE_BASE                 DCACHE_BASE_NS

#define IPCC1                       IPCC1_NS
#define IPCC1_BASE                  IPCC1_BASE_NS

#define IPCC1_C1                    IPCC1_C1_NS
#define IPCC1_C1_BASE               IPCC1_C1_BASE_NS

#define IPCC1_C2                    IPCC1_C2_NS
#define IPCC1_C2_BASE               IPCC1_C2_BASE_NS

#define DCMI                        DCMI_NS
#define DCMI_BASE                   DCMI_BASE_NS

#define PSSI                        PSSI_NS
#define PSSI_BASE                   PSSI_BASE_NS

#define CRC                         CRC_NS
#define CRC_BASE                    CRC_BASE_NS

#define MDF1                        MDF1_NS
#define MDF1_BASE                   MDF1_BASE_NS

#define MDF1_Filter0                MDF1_Filter0_NS
#define MDF1_Filter0_BASE           MDF1_Filter0_BASE_NS

#define MDF1_Filter1                MDF1_Filter1_NS
#define MDF1_Filter1_BASE           MDF1_Filter1_BASE_NS

#define MDF1_Filter2                MDF1_Filter2_NS
#define MDF1_Filter2_BASE           MDF1_Filter2_BASE_NS

#define MDF1_Filter3                MDF1_Filter3_NS
#define MDF1_Filter3_BASE           MDF1_Filter3_BASE_NS

#define MDF1_Filter4                MDF1_Filter4_NS
#define MDF1_Filter4_BASE           MDF1_Filter4_BASE_NS

#define MDF1_Filter5                MDF1_Filter5_NS
#define MDF1_Filter5_BASE           MDF1_Filter5_BASE_NS

#define MDF1_Filter6                MDF1_Filter6_NS
#define MDF1_Filter6_BASE           MDF1_Filter6_BASE_NS

#define MDF1_Filter7                MDF1_Filter7_NS
#define MDF1_Filter7_BASE           MDF1_Filter7_BASE_NS

#define ADC1                        ADC1_NS
#define ADC1_BASE                   ADC1_BASE_NS

#define ADC2                        ADC2_NS
#define ADC2_BASE                   ADC2_BASE_NS

#define ADC1_COMMON                 ADC1_COMMON_NS
#define ADC1_COMMON_BASE            ADC1_COMMON_BASE_NS

#define ADC2_COMMON                 ADC2_COMMON_NS
#define ADC2_COMMON_BASE            ADC2_COMMON_BASE_NS

#define HPDMA1_Channel0             HPDMA1_Channel0_NS
#define HPDMA1_Channel0_BASE        HPDMA1_Channel0_BASE_NS

#define HPDMA1_Channel1             HPDMA1_Channel1_NS
#define HPDMA1_Channel1_BASE        HPDMA1_Channel1_BASE_NS

#define HPDMA1_Channel2             HPDMA1_Channel2_NS
#define HPDMA1_Channel2_BASE        HPDMA1_Channel2_BASE_NS

#define HPDMA1_Channel3             HPDMA1_Channel3_NS
#define HPDMA1_Channel3_BASE        HPDMA1_Channel3_BASE_NS

#define HPDMA1_Channel4             HPDMA1_Channel4_NS
#define HPDMA1_Channel4_BASE        HPDMA1_Channel4_BASE_NS

#define HPDMA1_Channel5             HPDMA1_Channel5_NS
#define HPDMA1_Channel5_BASE        HPDMA1_Channel5_BASE_NS

