STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
/****************  Bit definition for FMC_CSQISR register  ****************/
#define FMC_CSQISR_TCF_Pos            (0U)
#define FMC_CSQISR_TCF_Msk            (0x1UL << FMC_CSQISR_TCF_Pos)           /*!< 0x00000001 */
#define FMC_CSQISR_TCF                FMC_CSQISR_TCF_Msk                     /*!< Transfer Complete flag */
#define FMC_CSQISR_SCF_Pos            (1U)
#define FMC_CSQISR_SCF_Msk            (0x1UL << FMC_CSQISR_SCF_Pos)           /*!< 0x00000002 */
#define FMC_CSQISR_SCF                FMC_CSQISR_SCF_Msk                     /*!< Sector Complete flag */
#define FMC_CSQISR_SEF_Pos            (2U)
#define FMC_CSQISR_SEF_Msk            (0x1UL << FMC_CSQISR_SEF_Pos)           /*!< 0x00000004 */
#define FMC_CSQISR_SEF                FMC_CSQISR_SEF_Msk                     /*!< Sector Error flag */
#define FMC_CSQISR_SUEF_Pos           (3U)
#define FMC_CSQISR_SUEF_Msk           (0x1UL << FMC_CSQISR_SUEF_Pos)          /*!< 0x00000008 */
#define FMC_CSQISR_SUEF               FMC_CSQISR_SUEF_Msk                    /*!< Sector Uncorrectable Error flag */
#define FMC_CSQISR_CMDTCF_Pos         (4U)
#define FMC_CSQISR_CMDTCF_Msk         (0x1UL << FMC_CSQISR_CMDTCF_Pos)        /*!< 0x00000010 */
#define FMC_CSQISR_CMDTCF             FMC_CSQISR_CMDTCF_Msk                  /*!< Command Transfer Complete flag */

/****************  Bit definition for FMC_CSQICR register  ****************/
#define FMC_CSQICR_CTCF_Pos           (0U)
#define FMC_CSQICR_CTCF_Msk           (0x1UL << FMC_CSQICR_CTCF_Pos)          /*!< 0x00000001 */
#define FMC_CSQICR_CTCF               FMC_CSQICR_CTCF_Msk                    /*!< Clear Transfer Complete flag */
#define FMC_CSQICR_CSCF_Pos           (1U)
#define FMC_CSQICR_CSCF_Msk           (0x1UL << FMC_CSQICR_CSCF_Pos)          /*!< 0x00000002 */
#define FMC_CSQICR_CSCF               FMC_CSQICR_CSCF_Msk                    /*!< Clear Sector Complete flag */
#define FMC_CSQICR_CSEF_Pos           (2U)
#define FMC_CSQICR_CSEF_Msk           (0x1UL << FMC_CSQICR_CSEF_Pos)          /*!< 0x00000004 */
#define FMC_CSQICR_CSEF               FMC_CSQICR_CSEF_Msk                    /*!< Clear Sector Error flag */
#define FMC_CSQICR_CSUEF_Pos          (3U)
#define FMC_CSQICR_CSUEF_Msk          (0x1UL << FMC_CSQICR_CSUEF_Pos)         /*!< 0x00000008 */
#define FMC_CSQICR_CSUEF              FMC_CSQICR_CSUEF_Msk                   /*!< Clear Sector uncorrectable Error flag */
#define FMC_CSQICR_CCMDTCF_Pos        (4U)
#define FMC_CSQICR_CCMDTCF_Msk        (0x1UL << FMC_CSQICR_CCMDTCF_Pos)       /*!< 0x00000010 */
#define FMC_CSQICR_CCMDTCF            FMC_CSQICR_CCMDTCF_Msk                 /*!< Clear Command Transfer Complete flag */

/***************  Bit definition for FMC_CSQEMSR register  ****************/
#define FMC_CSQEMSR_SEM_Pos           (0U)
#define FMC_CSQEMSR_SEM_Msk           (0xFFFFUL << FMC_CSQEMSR_SEM_Pos)       /*!< 0x0000FFFF */
#define FMC_CSQEMSR_SEM               FMC_CSQEMSR_SEM_Msk                    /*!< Sector Error mapping */

/****************  Bit definition for FMC_BCHIER register  ****************/
#define FMC_BCHIER_DUEIE_Pos          (0U)
#define FMC_BCHIER_DUEIE_Msk          (0x1UL << FMC_BCHIER_DUEIE_Pos)         /*!< 0x00000001 */
#define FMC_BCHIER_DUEIE              FMC_BCHIER_DUEIE_Msk                   /*!< Decoder Uncorrectable Errors Interrupt enable */
#define FMC_BCHIER_DERIE_Pos          (1U)
#define FMC_BCHIER_DERIE_Msk          (0x1UL << FMC_BCHIER_DERIE_Pos)         /*!< 0x00000002 */
#define FMC_BCHIER_DERIE              FMC_BCHIER_DERIE_Msk                   /*!< Decoder Error Ready Interrupt enable */
#define FMC_BCHIER_DEFIE_Pos          (2U)
#define FMC_BCHIER_DEFIE_Msk          (0x1UL << FMC_BCHIER_DEFIE_Pos)         /*!< 0x00000004 */
#define FMC_BCHIER_DEFIE              FMC_BCHIER_DEFIE_Msk                   /*!< Decoder Error Found Interrupt enable */
#define FMC_BCHIER_DSRIE_Pos          (3U)
#define FMC_BCHIER_DSRIE_Msk          (0x1UL << FMC_BCHIER_DSRIE_Pos)         /*!< 0x00000008 */
#define FMC_BCHIER_DSRIE              FMC_BCHIER_DSRIE_Msk                   /*!< Decoder Syndrome Ready Interrupt enable */
#define FMC_BCHIER_EPBRIE_Pos         (4U)
#define FMC_BCHIER_EPBRIE_Msk         (0x1UL << FMC_BCHIER_EPBRIE_Pos)        /*!< 0x00000010 */
#define FMC_BCHIER_EPBRIE             FMC_BCHIER_EPBRIE_Msk                  /*!< Decoder Parity Bits Ready Interrupt enable */

/****************  Bit definition for FMC_BCHISR register  ****************/
#define FMC_BCHISR_DUEF_Pos           (0U)
#define FMC_BCHISR_DUEF_Msk           (0x1UL << FMC_BCHISR_DUEF_Pos)          /*!< 0x00000001 */
#define FMC_BCHISR_DUEF               FMC_BCHISR_DUEF_Msk                    /*!< Decoder Uncorrectable Errors flag */
#define FMC_BCHISR_DERF_Pos           (1U)
#define FMC_BCHISR_DERF_Msk           (0x1UL << FMC_BCHISR_DERF_Pos)          /*!< 0x00000002 */
#define FMC_BCHISR_DERF               FMC_BCHISR_DERF_Msk                    /*!< Decoder Error Ready flag */
#define FMC_BCHISR_DEFF_Pos           (2U)
#define FMC_BCHISR_DEFF_Msk           (0x1UL << FMC_BCHISR_DEFF_Pos)          /*!< 0x00000004 */
#define FMC_BCHISR_DEFF               FMC_BCHISR_DEFF_Msk                    /*!< Decoder Error Found flag */
#define FMC_BCHISR_DSRF_Pos           (3U)
#define FMC_BCHISR_DSRF_Msk           (0x1UL << FMC_BCHISR_DSRF_Pos)          /*!< 0x00000008 */
#define FMC_BCHISR_DSRF               FMC_BCHISR_DSRF_Msk                    /*!< Decoder Syndrome Ready flag */
#define FMC_BCHISR_EPBRF_Pos          (4U)
#define FMC_BCHISR_EPBRF_Msk          (0x1UL << FMC_BCHISR_EPBRF_Pos)         /*!< 0x00000010 */
#define FMC_BCHISR_EPBRF              FMC_BCHISR_EPBRF_Msk                   /*!< Encoder Parity Bits Ready flag */

/****************  Bit definition for FMC_BCHICR register  ****************/
#define FMC_BCHICR_CDUEF_Pos          (0U)
#define FMC_BCHICR_CDUEF_Msk          (0x1UL << FMC_BCHICR_CDUEF_Pos)         /*!< 0x00000001 */
#define FMC_BCHICR_CDUEF              FMC_BCHICR_CDUEF_Msk                   /*!< Clear Decoder Uncorrectable Error flag */
#define FMC_BCHICR_CDERF_Pos          (1U)
#define FMC_BCHICR_CDERF_Msk          (0x1UL << FMC_BCHICR_CDERF_Pos)         /*!< 0x00000002 */
#define FMC_BCHICR_CDERF              FMC_BCHICR_CDERF_Msk                   /*!< Clear Decoder Error ready flag */
#define FMC_BCHICR_CDEFF_Pos          (2U)
#define FMC_BCHICR_CDEFF_Msk          (0x1UL << FMC_BCHICR_CDEFF_Pos)         /*!< 0x00000004 */
#define FMC_BCHICR_CDEFF              FMC_BCHICR_CDEFF_Msk                   /*!< Clear Decoder Error Found flag */
#define FMC_BCHICR_CDSRF_Pos          (3U)
#define FMC_BCHICR_CDSRF_Msk          (0x1UL << FMC_BCHICR_CDSRF_Pos)         /*!< 0x00000008 */
#define FMC_BCHICR_CDSRF              FMC_BCHICR_CDSRF_Msk                   /*!< Clear Decoder Syndrome Ready flag */
#define FMC_BCHICR_CEPBRF_Pos         (4U)
#define FMC_BCHICR_CEPBRF_Msk         (0x1UL << FMC_BCHICR_CEPBRF_Pos)        /*!< 0x00000010 */
#define FMC_BCHICR_CEPBRF             FMC_BCHICR_CEPBRF_Msk                  /*!< Clear Encoder Parity Bits Ready flag */

/***************  Bit definition for FMC_BCHPBR1 register  ****************/
#define FMC_BCHPBR1_BCHPB_Pos         (0U)
#define FMC_BCHPBR1_BCHPB_Msk         (0xFFFFFFFFUL << FMC_BCHPBR1_BCHPB_Pos) /*!< 0xFFFFFFFF */
#define FMC_BCHPBR1_BCHPB             FMC_BCHPBR1_BCHPB_Msk                  /*!< BCH parity bits */

/***************  Bit definition for FMC_BCHPBR2 register  ****************/
#define FMC_BCHPBR2_BCHPB_Pos         (0U)
#define FMC_BCHPBR2_BCHPB_Msk         (0xFFFFFFFFUL << FMC_BCHPBR2_BCHPB_Pos) /*!< 0xFFFFFFFF */
#define FMC_BCHPBR2_BCHPB             FMC_BCHPBR2_BCHPB_Msk                  /*!< BCH parity bits */

/***************  Bit definition for FMC_BCHPBR3 register  ****************/
#define FMC_BCHPBR3_BCHPB_Pos         (0U)
#define FMC_BCHPBR3_BCHPB_Msk         (0xFFFFFFFFUL << FMC_BCHPBR3_BCHPB_Pos) /*!< 0xFFFFFFFF */
#define FMC_BCHPBR3_BCHPB             FMC_BCHPBR3_BCHPB_Msk                  /*!< BCH parity bits */

/***************  Bit definition for FMC_BCHPBR4 register  ****************/
#define FMC_BCHPBR4_BCHPB_Pos         (0U)
#define FMC_BCHPBR4_BCHPB_Msk         (0xFFUL << FMC_BCHPBR4_BCHPB_Pos)       /*!< 0x000000FF */
#define FMC_BCHPBR4_BCHPB             FMC_BCHPBR4_BCHPB_Msk                  /*!< BCH parity bits */

/***************  Bit definition for FMC_BCHDSR0 register  ****************/
#define FMC_BCHDSR0_DUE_Pos           (0U)
#define FMC_BCHDSR0_DUE_Msk           (0x1UL << FMC_BCHDSR0_DUE_Pos)          /*!< 0x00000001 */
#define FMC_BCHDSR0_DUE               FMC_BCHDSR0_DUE_Msk                    /*!< Decoder uncorrectable error */
#define FMC_BCHDSR0_DEF_Pos           (1U)
#define FMC_BCHDSR0_DEF_Msk           (0x1UL << FMC_BCHDSR0_DEF_Pos)          /*!< 0x00000002 */
#define FMC_BCHDSR0_DEF               FMC_BCHDSR0_DEF_Msk                    /*!< Decoder error found */
#define FMC_BCHDSR0_DEN_Pos           (4U)
#define FMC_BCHDSR0_DEN_Msk           (0xFUL << FMC_BCHDSR0_DEN_Pos)          /*!< 0x000000F0 */
#define FMC_BCHDSR0_DEN               FMC_BCHDSR0_DEN_Msk                    /*!< Decoder error number */

/***************  Bit definition for FMC_BCHDSR1 register  ****************/
#define FMC_BCHDSR1_EBP1_Pos          (0U)
#define FMC_BCHDSR1_EBP1_Msk          (0x1FFFUL << FMC_BCHDSR1_EBP1_Pos)      /*!< 0x00001FFF */
#define FMC_BCHDSR1_EBP1              FMC_BCHDSR1_EBP1_Msk                   /*!< Error bit position for error number 1 */
#define FMC_BCHDSR1_EBP2_Pos          (16U)
#define FMC_BCHDSR1_EBP2_Msk          (0x1FFFUL << FMC_BCHDSR1_EBP2_Pos)      /*!< 0x1FFF0000 */
#define FMC_BCHDSR1_EBP2              FMC_BCHDSR1_EBP2_Msk                   /*!< Error bit position for error number 2 */

/***************  Bit definition for FMC_BCHDSR2 register  ****************/
#define FMC_BCHDSR2_EBP3_Pos          (0U)
#define FMC_BCHDSR2_EBP3_Msk          (0x1FFFUL << FMC_BCHDSR2_EBP3_Pos)      /*!< 0x00001FFF */
#define FMC_BCHDSR2_EBP3              FMC_BCHDSR2_EBP3_Msk                   /*!< Error bit position for error number 3 */
#define FMC_BCHDSR2_EBP4_Pos          (16U)
#define FMC_BCHDSR2_EBP4_Msk          (0x1FFFUL << FMC_BCHDSR2_EBP4_Pos)      /*!< 0x1FFF0000 */
#define FMC_BCHDSR2_EBP4              FMC_BCHDSR2_EBP4_Msk                   /*!< Error bit position for error number 4 */

/***************  Bit definition for FMC_BCHDSR3 register  ****************/
#define FMC_BCHDSR3_EBP5_Pos          (0U)
#define FMC_BCHDSR3_EBP5_Msk          (0x1FFFUL << FMC_BCHDSR3_EBP5_Pos)      /*!< 0x00001FFF */
#define FMC_BCHDSR3_EBP5              FMC_BCHDSR3_EBP5_Msk                   /*!< Error bit position for error number 5 */
#define FMC_BCHDSR3_EBP6_Pos          (16U)
#define FMC_BCHDSR3_EBP6_Msk          (0x1FFFUL << FMC_BCHDSR3_EBP6_Pos)      /*!< 0x1FFF0000 */
#define FMC_BCHDSR3_EBP6              FMC_BCHDSR3_EBP6_Msk                   /*!< Error bit position for error number 6 */

