STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
/******************  Bit definition for LTDC_ISR2 register  *******************/
#define LTDC_ISR2_LIF_Pos             (0U)
#define LTDC_ISR2_LIF_Msk             (0x1UL << LTDC_ISR2_LIF_Pos)/*!< 0x00000001 */
#define LTDC_ISR2_LIF                 LTDC_ISR2_LIF_Msk          /*!< Line interrupt flag */
#define LTDC_ISR2_FUWIF_Pos           (1U)
#define LTDC_ISR2_FUWIF_Msk           (0x1UL << LTDC_ISR2_FUWIF_Pos)  /*!< 0x00000002 */
#define LTDC_ISR2_FUWIF               LTDC_ISR2_FUWIF_Msk        /*!< FIFO underrun warning interrupt flag */
#define LTDC_ISR2_TERRIF_Pos          (2U)
#define LTDC_ISR2_TERRIF_Msk          (0x1UL << LTDC_ISR2_TERRIF_Pos)   /*!< 0x00000004 */
#define LTDC_ISR2_TERRIF              LTDC_ISR2_TERRIF_Msk       /*!< Transfer error interrupt flag */
#define LTDC_ISR2_RRIF_Pos            (3U)
#define LTDC_ISR2_RRIF_Msk            (0x1UL << LTDC_ISR2_RRIF_Pos) /*!< 0x00000008 */
#define LTDC_ISR2_RRIF                LTDC_ISR2_RRIF_Msk         /*!< Register reload interrupt flag */
#define LTDC_ISR2_FUKIF_Pos           (6U)
#define LTDC_ISR2_FUKIF_Msk           (0x1UL << LTDC_ISR2_FUKIF_Pos) /*!< 0x00000040 */
#define LTDC_ISR2_FUKIF               LTDC_ISR2_FKUIF_Msk        /*!< FIFO underrun killing error interrupt flag */
#define LTDC_ISR2_CRCIF_Pos           (7U)
#define LTDC_ISR2_CRCIF_Msk           (0x1UL << LTDC_ISR2_CRCIF_Pos)  /*!< 0x00000080 */
#define LTDC_ISR2_CRCIF               LTDC_ISR2_CRCIF_Msk        /*!< CRC Error interrupt flag */
#define LTDC_ISR2_FURIF_Pos           (8U)
#define LTDC_ISR2_FURIF_Msk           (0x1UL << LTDC_ISR2_FURIF_Pos)  /*!< 0x00000100 */
#define LTDC_ISR2_FURIF               LTDC_ISR2_FURIF_Msk        /*!< FIFO underrun error at rotation interrupt flag */

/******************  Bit definition for LTDC_ICR2 register  *******************/
#define LTDC_ICR2_CLIF_Pos            (0U)
#define LTDC_ICR2_CLIF_Msk            (0x1UL << LTDC_ICR2_CLIF_Pos) /*!< 0x00000001 */
#define LTDC_ICR2_CLIF                LTDC_ICR2_CLIF_Msk         /*!< clears the Line interrupt flag */
#define LTDC_ICR2_CFUWIF_Pos          (1U)
#define LTDC_ICR2_CFUWIF_Msk          (0x1UL << LTDC_ICR2_CFUWIF_Pos)   /*!< 0x00000002 */
#define LTDC_ICR2_CFUWIF              LTDC_ICR2_CFUWIF_Msk       /*!< clears the FIFO underrun warning interrupt flag */
#define LTDC_ICR2_CTERRIF_Pos         (2U)
#define LTDC_ICR2_CTERRIF_Msk         (0x1UL << LTDC_ICR2_CTERRIF_Pos)    /*!< 0x00000004 */
#define LTDC_ICR2_CTERRIF             LTDC_ICR2_CTERRIF_Msk      /*!< clears the Transfer Error interrupt flag */
#define LTDC_ICR2_CRRIF_Pos           (3U)
#define LTDC_ICR2_CRRIF_Msk           (0x1UL << LTDC_ICR2_CRRIF_Pos)  /*!< 0x00000008 */
#define LTDC_ICR2_CRRIF               LTDC_ICR2_CRRIF_Msk        /*!< clears register reload interrupt flag */
#define LTDC_ICR2_CFUKIF_Pos          (6U)
#define LTDC_ICR2_CFUKIF_Msk          (0x1UL << LTDC_ICR2_CFUKIF_Pos) /*!< 0x00000040 */
#define LTDC_ICR2_CFUKIF              LTDC_ICR2_CFUKIF_Msk       /*!< clears the FIFO underrun killing error interrupt flag */
#define LTDC_ICR2_CCRCIF_Pos          (7U)
#define LTDC_ICR2_CCRCIF_Msk          (0x1UL << LTDC_ICR2_CCRCIF_Pos)   /*!< 0x00000080 */
#define LTDC_ICR2_CCRCIF              LTDC_ICR2_CCRCIF_Msk       /*!< clears the CRC error interrupt flag */
#define LTDC_ICR2_CFURIF_Pos          (8U)
#define LTDC_ICR2_CFURIF_Msk          (0x1UL << LTDC_ICR2_CFURIF_Pos)   /*!< 0x00000100 */
#define LTDC_ICR2_CFURIF              LTDC_ICR2_CFURIF_Msk       /*!< clears FIFO underrun error at rotation interrupt flag */

/******************  Bit definition for LTDC_CPSR2 register  ******************/
#define LTDC_CPSR2_CYPOS_Pos          (0U)
#define LTDC_CPSR2_CYPOS_Msk          (0xFFFFUL << LTDC_CPSR2_CYPOS_Pos)      /*!< 0x0000FFFF */
#define LTDC_CPSR2_CYPOS              LTDC_CPSR2_CYPOS_Msk       /*!< current Y position  */
#define LTDC_CPSR2_CXPOS_Pos          (16U)
#define LTDC_CPSR2_CXPOS_Msk          (0xFFFFUL << LTDC_CPSR2_CXPOS_Pos)      /*!< 0xFFFF0000 */
#define LTDC_CPSR2_CXPOS              LTDC_CPSR2_CXPOS_Msk       /*!< current X position  */

/******************  Bit definition for LTDC_ECRCR register  ******************/
#define LTDC_ECRCR_ECRC_Pos           (0U)
#define LTDC_ECRCR_ECRC_Msk           (0xFFFFUL << LTDC_ECRCR_ECRC_Pos)     /*!< 0x0000FFFF */
#define LTDC_ECRCR_ECRC               LTDC_ECRCR_ECRC_Msk        /*!< expected CRC of frame */

/******************  Bit definition for LTDC_CCRCR register  ******************/
#define LTDC_CCRCR_CCRC_Pos           (0U)
#define LTDC_CCRCR_CCRC_Msk           (0xFFFFUL << LTDC_CCRCR_CCRC_Pos)     /*!< 0x0000FFFF */
#define LTDC_CCRCR_CCRC               LTDC_CCRCR_CCRC_Msk        /*!< computed CRC of frame */


/******************  Bit definition for LTDC_FUTR register  *******************/
#define LTDC_FUTR_THRE_Pos            (0U)
#define LTDC_FUTR_THRE_Msk            (0xFFFFUL << LTDC_FUTR_THRE_Pos)    /*!< 0x0000FFFF */
#define LTDC_FUTR_THRE                LTDC_FUTR_THRE_Msk         /*!< threshold to trigger a FIFO underrun interrupt (per FIFO word, 64 bits) */

/******************  Bit definition for LTDC_LxC0R register  ******************/
#define LTDC_LxC0R_CKTA_Pos           (0U)
#define LTDC_LxC0R_CKTA_Msk           (0x1UL << LTDC_LxC0R_CKTA_Pos)  /*!< 0x00000001 */
#define LTDC_LxC0R_CKTA               LTDC_LxC0R_CKTA_Msk        /*!< color key transparency ability */
#define LTDC_LxC0R_CFBDA_Pos          (1U)
#define LTDC_LxC0R_CFBDA_Msk          (0x1UL << LTDC_LxC0R_CFBDA_Pos)   /*!< 0x00000002 */
#define LTDC_LxC0R_CFBDA              LTDC_LxC0R_CFBDA_Msk       /*!< color frame buffer duplication ability */
#define LTDC_LxC0R_CFBPA_Pos          (2U)
#define LTDC_LxC0R_CFBPA_Msk          (0x1UL << LTDC_LxC0R_CFBPA_Pos)   /*!< 0x00000004 */
#define LTDC_LxC0R_CFBPA              LTDC_LxC0R_CFBPA_Msk       /*!< color frame buffer pitch ability */
#define LTDC_LxC0R_APA_Pos            (3U)
#define LTDC_LxC0R_APA_Msk            (0x1UL << LTDC_LxC0R_APA_Pos) /*!< 0x00000008 */
#define LTDC_LxC0R_APA                LTDC_LxC0R_APA_Msk         /*!< alpha plane ability */
#define LTDC_LxC0R_DCP_Pos            (4U)
#define LTDC_LxC0R_DCP_Msk            (0x1UL << LTDC_LxC0R_DCP_Pos) /*!< 0x00000010 */
#define LTDC_LxC0R_DCP                LTDC_LxC0R_DCP_Msk         /*!< default color programmability */
#define LTDC_LxC0R_WINA_Pos           (5U)
#define LTDC_LxC0R_WINA_Msk           (0x1UL << LTDC_LxC0R_WINA_Pos)  /*!< 0x00000020 */
#define LTDC_LxC0R_WINA               LTDC_LxC0R_WINA_Msk        /*!< windowing ability */
#define LTDC_LxC0R_CLUTA_Pos          (6U)
#define LTDC_LxC0R_CLUTA_Msk          (0x1UL << LTDC_LxC0R_CLUTA_Pos)   /*!< 0x00000040 */
#define LTDC_LxC0R_CLUTA              LTDC_LxC0R_CLUTA_Msk       /*!< CLUT ability */
#define LTDC_LxC0R_CKRA_Pos           (7U)
#define LTDC_LxC0R_CKRA_Msk           (0x1UL << LTDC_LxC0R_CKRA_Pos)  /*!< 0x00000080 */
#define LTDC_LxC0R_CKRA               LTDC_LxC0R_CKRA_Msk        /*!< color key replace ability */
#define LTDC_LxC0R_F21_Pos            (8U)
#define LTDC_LxC0R_F21_Msk            (0x1UL << LTDC_LxC0R_F21_Pos) /*!< 0x00000100 */
#define LTDC_LxC0R_F21                LTDC_LxC0R_F21_Msk         /*!< blending factor 2, ability for: 1 */
#define LTDC_LxC0R_F20_Pos            (9U)
#define LTDC_LxC0R_F20_Msk            (0x1UL << LTDC_LxC0R_F20_Pos) /*!< 0x00000200 */
#define LTDC_LxC0R_F20                LTDC_LxC0R_F20_Msk         /*!< blending factor 2, ability for: 0 */
#define LTDC_LxC0R_F2P_Pos            (10U)
#define LTDC_LxC0R_F2P_Msk            (0x1UL << LTDC_LxC0R_F2P_Pos) /*!< 0x00000400 */
#define LTDC_LxC0R_F2P                LTDC_LxC0R_F2P_Msk         /*!< blending factor 2, ability for: pixel_alpha */
#define LTDC_LxC0R_F21P_Pos           (11U)
#define LTDC_LxC0R_F21P_Msk           (0x1UL << LTDC_LxC0R_F21P_Pos)  /*!< 0x00000800 */
#define LTDC_LxC0R_F21P               LTDC_LxC0R_F21P_Msk        /*!< blending factor 2, ability for: 1 */
#define LTDC_LxC0R_F2C_Pos            (12U)
#define LTDC_LxC0R_F2C_Msk            (0x1UL << LTDC_LxC0R_F2C_Pos) /*!< 0x00001000 */
#define LTDC_LxC0R_F2C                LTDC_LxC0R_F2C_Msk         /*!< blending factor 2, ability for: constant_alpha */
#define LTDC_LxC0R_F21C_Pos           (13U)
#define LTDC_LxC0R_F21C_Msk           (0x1UL << LTDC_LxC0R_F21C_Pos)  /*!< 0x00002000 */
#define LTDC_LxC0R_F21C               LTDC_LxC0R_F21C_Msk        /*!< blending factor 2, ability for: 1 */
#define LTDC_LxC0R_F2PC_Pos           (14U)
#define LTDC_LxC0R_F2PC_Msk           (0x1UL << LTDC_LxC0R_F2PC_Pos)  /*!< 0x00004000 */
#define LTDC_LxC0R_F2PC               LTDC_LxC0R_F2PC_Msk        /*!< blending factor 2, ability for: pixel_alpha * constant_alpha */
#define LTDC_LxC0R_F21PC_Pos          (15U)
#define LTDC_LxC0R_F21PC_Msk          (0x1UL << LTDC_LxC0R_F21PC_Pos)   /*!< 0x00008000 */
#define LTDC_LxC0R_F21PC              LTDC_LxC0R_F21PC_Msk       /*!< blending factor 2, ability for: 1 */
#define LTDC_LxC0R_F11_Pos            (16U)
#define LTDC_LxC0R_F11_Msk            (0x1UL << LTDC_LxC0R_F11_Pos) /*!< 0x00010000 */
#define LTDC_LxC0R_F11                LTDC_LxC0R_F11_Msk         /*!< blending factor 1, ability for: 1 */
#define LTDC_LxC0R_F10_Pos            (17U)
#define LTDC_LxC0R_F10_Msk            (0x1UL << LTDC_LxC0R_F10_Pos) /*!< 0x00020000 */
#define LTDC_LxC0R_F10                LTDC_LxC0R_F10_Msk         /*!< blending factor 1,ability for: 0 */
#define LTDC_LxC0R_F1P_Pos            (18U)
#define LTDC_LxC0R_F1P_Msk            (0x1UL << LTDC_LxC0R_F1P_Pos) /*!< 0x00040000 */
#define LTDC_LxC0R_F1P                LTDC_LxC0R_F1P_Msk         /*!< blending factor 1, ability for: pixel_alpha */
#define LTDC_LxC0R_F11P_Pos           (19U)
#define LTDC_LxC0R_F11P_Msk           (0x1UL << LTDC_LxC0R_F11P_Pos)  /*!< 0x00080000 */
#define LTDC_LxC0R_F11P               LTDC_LxC0R_F11P_Msk        /*!< blending factor 1, ability for: 1 */
#define LTDC_LxC0R_F1C_Pos            (20U)
#define LTDC_LxC0R_F1C_Msk            (0x1UL << LTDC_LxC0R_F1C_Pos) /*!< 0x00100000 */
#define LTDC_LxC0R_F1C                LTDC_LxC0R_F1C_Msk         /*!< blending factor 1, ability for: constant_alpha */
#define LTDC_LxC0R_F11C_Pos           (21U)
#define LTDC_LxC0R_F11C_Msk           (0x1UL << LTDC_LxC0R_F11C_Pos)  /*!< 0x00200000 */
#define LTDC_LxC0R_F11C               LTDC_LxC0R_F11C_Msk        /*!< blending factor 1, ability for: 1 */
#define LTDC_LxC0R_F1PC_Pos           (22U)
#define LTDC_LxC0R_F1PC_Msk           (0x1UL << LTDC_LxC0R_F1PC_Pos)  /*!< 0x00400000 */
#define LTDC_LxC0R_F1PC               LTDC_LxC0R_F1PC_Msk        /*!< blending factor 1, ability for: pixel_alpha * constant_alpha */
#define LTDC_LxC0R_F11PC_Pos          (23U)
#define LTDC_LxC0R_F11PC_Msk          (0x1UL << LTDC_LxC0R_F11PC_Pos)   /*!< 0x00800000 */
#define LTDC_LxC0R_F11PC              LTDC_LxC0R_F11PC_Msk       /*!< blending factor 1, ability for: 1 */
#define LTDC_LxC0R_P88_Pos            (24U)
#define LTDC_LxC0R_P88_Msk            (0x1UL << LTDC_LxC0R_P88_Pos) /*!< 0x01000000 */
#define LTDC_LxC0R_P88                LTDC_LxC0R_P88_Msk         /*!< pixel format, ability for: AL88 */
#define LTDC_LxC0R_P44_Pos            (25U)
#define LTDC_LxC0R_P44_Msk            (0x1UL << LTDC_LxC0R_P44_Pos) /*!< 0x02000000 */
#define LTDC_LxC0R_P44                LTDC_LxC0R_P44_Msk         /*!< pixel format, ability for: AL44 */
#define LTDC_LxC0R_P8_Pos             (26U)
#define LTDC_LxC0R_P8_Msk             (0x1UL << LTDC_LxC0R_P8_Pos)/*!< 0x04000000 */
#define LTDC_LxC0R_P8                 LTDC_LxC0R_P8_Msk          /*!< pixel format, ability for: L8 */
#define LTDC_LxC0R_P4444_Pos          (27U)
#define LTDC_LxC0R_P4444_Msk          (0x1UL << LTDC_LxC0R_P4444_Pos)   /*!< 0x08000000 */
#define LTDC_LxC0R_P4444              LTDC_LxC0R_P4444_Msk       /*!< pixel format, ability for: ARGB4444 */
#define LTDC_LxC0R_P1555_Pos          (28U)
#define LTDC_LxC0R_P1555_Msk          (0x1UL << LTDC_LxC0R_P1555_Pos)   /*!< 0x10000000 */
#define LTDC_LxC0R_P1555              LTDC_LxC0R_P1555_Msk       /*!< pixel format, ability for: ARGB1555 */
#define LTDC_LxC0R_P565_Pos           (29U)
#define LTDC_LxC0R_P565_Msk           (0x1UL << LTDC_LxC0R_P565_Pos)  /*!< 0x20000000 */
#define LTDC_LxC0R_P565               LTDC_LxC0R_P565_Msk        /*!< pixel format, ability for: RGB565 */
#define LTDC_LxC0R_P888_Pos           (30U)
#define LTDC_LxC0R_P888_Msk           (0x1UL << LTDC_LxC0R_P888_Pos)  /*!< 0x40000000 */
#define LTDC_LxC0R_P888               LTDC_LxC0R_P888_Msk        /*!< pixel format, ability for: RGB888 */
#define LTDC_LxC0R_P8888_Pos          (31U)
#define LTDC_LxC0R_P8888_Msk          (0x1UL << LTDC_LxC0R_P8888_Pos)   /*!< 0x80000000 */
#define LTDC_LxC0R_P8888              LTDC_LxC0R_P8888_Msk       /*!< pixel format, ability for: ARGB8888 */

/******************  Bit definition for LTDC_LxC1R register  ******************/
#define LTDC_LxC1R_YIA_Pos            (0U)
#define LTDC_LxC1R_YIA_Msk            (0x1UL << LTDC_LxC1R_YIA_Pos) /*!< 0x00000001 */
#define LTDC_LxC1R_YIA                LTDC_LxC1R_YIA_Msk         /*!< YCbCr 422 interleaved ability for that layer */
#define LTDC_LxC1R_YSPA_Pos           (1U)
#define LTDC_LxC1R_YSPA_Msk           (0x1UL << LTDC_LxC1R_YSPA_Pos)  /*!< 0x00000002 */
#define LTDC_LxC1R_YSPA               LTDC_LxC1R_YSPA_Msk        /*!< YCbCr 420 semi-planar ability for that layer */
#define LTDC_LxC1R_YFPA_Pos           (2U)
#define LTDC_LxC1R_YFPA_Msk           (0x1UL << LTDC_LxC1R_YFPA_Pos)  /*!< 0x00000004 */
#define LTDC_LxC1R_YFPA               LTDC_LxC1R_YFPA_Msk        /*!< YCbCr 420 full-planar ability for that layer */
#define LTDC_LxC1R_SCA_Pos            (31U)
#define LTDC_LxC1R_SCA_Msk            (0x1UL << LTDC_LxC1R_SCA_Pos) /*!< 0x80000000 */
#define LTDC_LxC1R_SCA                LTDC_LxC1R_SCA_Msk         /*!< scaling ability for that layer */

