STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
/* Bit fields for RCC_SYSRAMCFGR register */
#define RCC_SYSRAMCFGR_SYSRAMEN_Pos                (1U)
#define RCC_SYSRAMCFGR_SYSRAMEN_Msk                (0x1UL << RCC_SYSRAMCFGR_SYSRAMEN_Pos)               /*!< 0x00000002 */
#define RCC_SYSRAMCFGR_SYSRAMEN                    RCC_SYSRAMCFGR_SYSRAMEN_Msk                       /*!< SYSRAM clock enable */
#define RCC_SYSRAMCFGR_SYSRAMLPEN_Pos              (2U)
#define RCC_SYSRAMCFGR_SYSRAMLPEN_Msk              (0x1UL << RCC_SYSRAMCFGR_SYSRAMLPEN_Pos)             /*!< 0x00000004 */
#define RCC_SYSRAMCFGR_SYSRAMLPEN                  RCC_SYSRAMCFGR_SYSRAMLPEN_Msk                     /*!< SYSRAM clock enable during CSleep */

/* Bit fields for RCC_SRAM1CFGR register */
#define RCC_SRAM1CFGR_SRAM1EN_Pos                  (1U)
#define RCC_SRAM1CFGR_SRAM1EN_Msk                  (0x1UL << RCC_SRAM1CFGR_SRAM1EN_Pos)                 /*!< 0x00000002 */
#define RCC_SRAM1CFGR_SRAM1EN                      RCC_SRAM1CFGR_SRAM1EN_Msk                         /*!< SRAM1 clock enable */
#define RCC_SRAM1CFGR_SRAM1LPEN_Pos                (2U)
#define RCC_SRAM1CFGR_SRAM1LPEN_Msk                (0x1UL << RCC_SRAM1CFGR_SRAM1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_SRAM1CFGR_SRAM1LPEN                    RCC_SRAM1CFGR_SRAM1LPEN_Msk                       /*!< SRAM1 clock enable during CSleep */

/* Bit fields for RCC_RETRAMCFGR register */
#define RCC_RETRAMCFGR_RETRAMEN_Pos                (1U)
#define RCC_RETRAMCFGR_RETRAMEN_Msk                (0x1UL << RCC_RETRAMCFGR_RETRAMEN_Pos)               /*!< 0x00000002 */
#define RCC_RETRAMCFGR_RETRAMEN                    RCC_RETRAMCFGR_RETRAMEN_Msk                       /*!< RETRAM clock enable */
#define RCC_RETRAMCFGR_RETRAMLPEN_Pos              (2U)
#define RCC_RETRAMCFGR_RETRAMLPEN_Msk              (0x1UL << RCC_RETRAMCFGR_RETRAMLPEN_Pos)             /*!< 0x00000004 */
#define RCC_RETRAMCFGR_RETRAMLPEN                  RCC_RETRAMCFGR_RETRAMLPEN_Msk                     /*!< RETRAM clock enable during CSleep */

/***************  Bit fields for RCC_BKPSRAMCFGR register */
#define RCC_BKPSRAMCFGR_BKPSRAMEN_Pos              (1U)
#define RCC_BKPSRAMCFGR_BKPSRAMEN_Msk              (0x1UL << RCC_BKPSRAMCFGR_BKPSRAMEN_Pos)             /*!< 0x00000002 */
#define RCC_BKPSRAMCFGR_BKPSRAMEN                  RCC_BKPSRAMCFGR_BKPSRAMEN_Msk                     /*!< BKPSRAM clock enable */
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN_Pos            (2U)
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN_Msk            (0x1UL << RCC_BKPSRAMCFGR_BKPSRAMLPEN_Pos)           /*!< 0x00000004 */
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN                RCC_BKPSRAMCFGR_BKPSRAMLPEN_Msk                   /*!< BKPSRAM clock enable during CSleep */

/* Bit fields for RCC_OSPI1CFGR register */
#define RCC_OSPI1CFGR_OSPI1RST_Pos                 (0U)
#define RCC_OSPI1CFGR_OSPI1RST_Msk                 (0x1UL << RCC_OSPI1CFGR_OSPI1RST_Pos)                /*!< 0x00000001 */
#define RCC_OSPI1CFGR_OSPI1RST                     RCC_OSPI1CFGR_OSPI1RST_Msk                        /*!< OCTOSPI1 reset */
#define RCC_OSPI1CFGR_OSPI1EN_Pos                  (1U)
#define RCC_OSPI1CFGR_OSPI1EN_Msk                  (0x1UL << RCC_OSPI1CFGR_OSPI1EN_Pos)                 /*!< 0x00000002 */
#define RCC_OSPI1CFGR_OSPI1EN                      RCC_OSPI1CFGR_OSPI1EN_Msk                         /*!< OCTOSPI1 and OTFDEC1 clock enable */
#define RCC_OSPI1CFGR_OSPI1LPEN_Pos                (2U)
#define RCC_OSPI1CFGR_OSPI1LPEN_Msk                (0x1UL << RCC_OSPI1CFGR_OSPI1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_OSPI1CFGR_OSPI1LPEN                    RCC_OSPI1CFGR_OSPI1LPEN_Msk                       /*!< OCTOSPI1, OTFDEC1 and OCTOSPI1 delay (DLYBOSPI1) clock enable during�CSleep */
#define RCC_OSPI1CFGR_OTFDEC1RST_Pos               (8U)
#define RCC_OSPI1CFGR_OTFDEC1RST_Msk               (0x1UL << RCC_OSPI1CFGR_OTFDEC1RST_Pos)              /*!< 0x00000100 */
#define RCC_OSPI1CFGR_OTFDEC1RST                   RCC_OSPI1CFGR_OTFDEC1RST_Msk                      /*!< OTFDEC1 reset */
#define RCC_OSPI1CFGR_OSPI1DLLRST_Pos              (16U)
#define RCC_OSPI1CFGR_OSPI1DLLRST_Msk              (0x1UL << RCC_OSPI1CFGR_OSPI1DLLRST_Pos)             /*!< 0x00010000 */
#define RCC_OSPI1CFGR_OSPI1DLLRST                  RCC_OSPI1CFGR_OSPI1DLLRST_Msk                     /*!< OCTOSPI1 DLL reset */

/* Bit fields for RCC_FMCCFGR register  ******************/
#define RCC_FMCCFGR_FMCRST_Pos                     (0U)
#define RCC_FMCCFGR_FMCRST_Msk                     (0x1UL << RCC_FMCCFGR_FMCRST_Pos)                    /*!< 0x00000001 */
#define RCC_FMCCFGR_FMCRST                         RCC_FMCCFGR_FMCRST_Msk                            /*!< FMC reset */
#define RCC_FMCCFGR_FMCEN_Pos                      (1U)
#define RCC_FMCCFGR_FMCEN_Msk                      (0x1UL << RCC_FMCCFGR_FMCEN_Pos)                   /*!< 0x00000002 */
#define RCC_FMCCFGR_FMCEN                          RCC_FMCCFGR_FMCEN_Msk                             /*!< FMC clock enable */
#define RCC_FMCCFGR_FMCLPEN_Pos                    (2U)
#define RCC_FMCCFGR_FMCLPEN_Msk                    (0x1UL << RCC_FMCCFGR_FMCLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_FMCCFGR_FMCLPEN                        RCC_FMCCFGR_FMCLPEN_Msk                           /*!< FMC clock enable during CSleep */

/* Bit fields for RCC_DBGCFGR register  ******************/
#define RCC_DBGCFGR_DBGEN_Pos                      (8U)
#define RCC_DBGCFGR_DBGEN_Msk                      (0x1UL << RCC_DBGCFGR_DBGEN_Pos)                   /*!< 0x00000100 */
#define RCC_DBGCFGR_DBGEN                          RCC_DBGCFGR_DBGEN_Msk                             /*!< Debug function clock enable */
#define RCC_DBGCFGR_TRACEEN_Pos                    (9U)
#define RCC_DBGCFGR_TRACEEN_Msk                    (0x1UL << RCC_DBGCFGR_TRACEEN_Pos)                   /*!< 0x00000200 */
#define RCC_DBGCFGR_TRACEEN                        RCC_DBGCFGR_TRACEEN_Msk                           /*!< Clock enable for trace port interface */
#define RCC_DBGCFGR_DBGMCUEN_Pos                   (10U)
#define RCC_DBGCFGR_DBGMCUEN_Msk                   (0x1UL << RCC_DBGCFGR_DBGMCUEN_Pos)                  /*!< 0x00000400 */
#define RCC_DBGCFGR_DBGMCUEN                       RCC_DBGCFGR_DBGMCUEN_Msk                          /*!< Clock enable for dbgmcu */
#define RCC_DBGCFGR_DBGRST_Pos                     (12U)
#define RCC_DBGCFGR_DBGRST_Msk                     (0x1UL << RCC_DBGCFGR_DBGRST_Pos)                    /*!< 0x00001000 */
#define RCC_DBGCFGR_DBGRST                         RCC_DBGCFGR_DBGRST_Msk                            /*!< Debug function reset */

/* Bit fields for RCC_STMCFGR register  ******************/
#define RCC_STMCFGR_STMEN_Pos                      (1U)
#define RCC_STMCFGR_STMEN_Msk                      (0x1UL << RCC_STMCFGR_STMEN_Pos)                   /*!< 0x00000002 */
#define RCC_STMCFGR_STMEN                          RCC_STMCFGR_STMEN_Msk                             /*!< STM clock enable */
#define RCC_STMCFGR_STMLPEN_Pos                    (2U)
#define RCC_STMCFGR_STMLPEN_Msk                    (0x1UL << RCC_STMCFGR_STMLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_STMCFGR_STMLPEN                        RCC_STMCFGR_STMLPEN_Msk                           /*!< STM clock enable during CSleep */

/* Bit fields for RCC_ETRCFGR register  ******************/
#define RCC_ETRCFGR_ETREN_Pos                      (1U)
#define RCC_ETRCFGR_ETREN_Msk                      (0x1UL << RCC_ETRCFGR_ETREN_Pos)                   /*!< 0x00000002 */
#define RCC_ETRCFGR_ETREN                          RCC_ETRCFGR_ETREN_Msk                             /*!< ETR clocks enable */
#define RCC_ETRCFGR_ETRLPEN_Pos                    (2U)
#define RCC_ETRCFGR_ETRLPEN_Msk                    (0x1UL << RCC_ETRCFGR_ETRLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_ETRCFGR_ETRLPEN                        RCC_ETRCFGR_ETRLPEN_Msk                           /*!< ETR clock enable during CSleep */

/* Bit fields for RCC_GPIOACFGR register */
#define RCC_GPIOACFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOACFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOACFGR_GPIOxRST_Pos)
#define RCC_GPIOACFGR_GPIOxRST                       RCC_GPIOACFGR_GPIOxRST_Msk
#define RCC_GPIOACFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOACFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOACFGR_GPIOxEN_Pos)
#define RCC_GPIOACFGR_GPIOxEN                        RCC_GPIOACFGR_GPIOxEN_Msk
#define RCC_GPIOACFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOACFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOACFGR_GPIOxLPEN_Pos)
#define RCC_GPIOACFGR_GPIOxLPEN                      RCC_GPIOACFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOBCFGR register */
#define RCC_GPIOBCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOBCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOBCFGR_GPIOxRST_Pos)
#define RCC_GPIOBCFGR_GPIOxRST                       RCC_GPIOBCFGR_GPIOxRST_Msk
#define RCC_GPIOBCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOBCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOBCFGR_GPIOxEN_Pos)
#define RCC_GPIOBCFGR_GPIOxEN                        RCC_GPIOBCFGR_GPIOxEN_Msk
#define RCC_GPIOBCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOBCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOBCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOBCFGR_GPIOxLPEN                      RCC_GPIOBCFGR_GPIOxLPEN_Msk

