STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
/*******************  Bits definition for RISC_PRIVCFGR2 register *************/
#define RISC_PRIVCFGR2_PRIV64_Pos     (0U)
#define RISC_PRIVCFGR2_PRIV64_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV64_Pos)       /*!< 0x00000001 */
#define RISC_PRIVCFGR2_PRIV64         RISC_PRIVCFGR2_PRIV64_Msk
#define RISC_PRIVCFGR2_PRIV65_Pos     (1U)
#define RISC_PRIVCFGR2_PRIV65_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV65_Pos)       /*!< 0x00000002 */
#define RISC_PRIVCFGR2_PRIV65         RISC_PRIVCFGR2_PRIV65_Msk
#define RISC_PRIVCFGR2_PRIV66_Pos     (2U)
#define RISC_PRIVCFGR2_PRIV66_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV66_Pos)       /*!< 0x00000004 */
#define RISC_PRIVCFGR2_PRIV66         RISC_PRIVCFGR2_PRIV66_Msk
#define RISC_PRIVCFGR2_PRIV67_Pos     (3U)
#define RISC_PRIVCFGR2_PRIV67_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV67_Pos)       /*!< 0x00000008 */
#define RISC_PRIVCFGR2_PRIV67         RISC_PRIVCFGR2_PRIV67_Msk
#define RISC_PRIVCFGR2_PRIV68_Pos     (4U)
#define RISC_PRIVCFGR2_PRIV68_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV68_Pos)       /*!< 0x00000010 */
#define RISC_PRIVCFGR2_PRIV68         RISC_PRIVCFGR2_PRIV68_Msk
#define RISC_PRIVCFGR2_PRIV69_Pos     (5U)
#define RISC_PRIVCFGR2_PRIV69_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV69_Pos)       /*!< 0x00000020 */
#define RISC_PRIVCFGR2_PRIV69         RISC_PRIVCFGR2_PRIV69_Msk
#define RISC_PRIVCFGR2_PRIV70_Pos     (6U)
#define RISC_PRIVCFGR2_PRIV70_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV70_Pos)       /*!< 0x00000040 */
#define RISC_PRIVCFGR2_PRIV70         RISC_PRIVCFGR2_PRIV70_Msk
#define RISC_PRIVCFGR2_PRIV71_Pos     (7U)
#define RISC_PRIVCFGR2_PRIV71_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV71_Pos)       /*!< 0x00000080 */
#define RISC_PRIVCFGR2_PRIV71          RISC_PRIVCFGR2_PRIV71_Msk
#define RISC_PRIVCFGR2_PRIV72_Pos     (8U)
#define RISC_PRIVCFGR2_PRIV72_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV72_Pos)       /*!< 0x00000100 */
#define RISC_PRIVCFGR2_PRIV72         RISC_PRIVCFGR2_PRIV72_Msk
#define RISC_PRIVCFGR2_PRIV73_Pos     (9U)
#define RISC_PRIVCFGR2_PRIV73_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV73_Pos)       /*!< 0x00000200 */
#define RISC_PRIVCFGR2_PRIV73         RISC_PRIVCFGR2_PRIV73_Msk
#define RISC_PRIVCFGR2_PRIV74_Pos     (10U)
#define RISC_PRIVCFGR2_PRIV74_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV74_Pos)       /*!< 0x00000400 */
#define RISC_PRIVCFGR2_PRIV74         RISC_PRIVCFGR2_PRIV74_Msk
#define RISC_PRIVCFGR2_PRIV75_Pos     (11U)
#define RISC_PRIVCFGR2_PRIV75_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV75_Pos)       /*!< 0x00000800 */
#define RISC_PRIVCFGR2_PRIV75         RISC_PRIVCFGR2_PRIV75_Msk
#define RISC_PRIVCFGR2_PRIV76_Pos     (12U)
#define RISC_PRIVCFGR2_PRIV76_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV76_Pos)       /*!< 0x00001000 */
#define RISC_PRIVCFGR2_PRIV76         RISC_PRIVCFGR2_PRIV76_Msk
#define RISC_PRIVCFGR2_PRIV77_Pos     (13U)
#define RISC_PRIVCFGR2_PRIV77_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV77_Pos)       /*!< 0x00002000 */
#define RISC_PRIVCFGR2_PRIV77         RISC_PRIVCFGR2_PRIV77_Msk
#define RISC_PRIVCFGR2_PRIV78_Pos     (14U)
#define RISC_PRIVCFGR2_PRIV78_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV78_Pos)       /*!< 0x00004000 */
#define RISC_PRIVCFGR2_PRIV78         RISC_PRIVCFGR2_PRIV78_Msk
#define RISC_PRIVCFGR2_PRIV79_Pos     (15U)
#define RISC_PRIVCFGR2_PRIV79_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV79_Pos)       /*!< 0x00008000 */
#define RISC_PRIVCFGR2_PRIV79         RISC_PRIVCFGR2_PRIV79_Msk
#define RISC_PRIVCFGR2_PRIV80_Pos     (16U)
#define RISC_PRIVCFGR2_PRIV80_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV80_Pos)       /*!< 0x00010000 */
#define RISC_PRIVCFGR2_PRIV80         RISC_PRIVCFGR2_PRIV80_Msk
#define RISC_PRIVCFGR2_PRIV81_Pos     (17U)
#define RISC_PRIVCFGR2_PRIV81_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV81_Pos)       /*!< 0x00020000 */
#define RISC_PRIVCFGR2_PRIV81         RISC_PRIVCFGR2_PRIV81_Msk
#define RISC_PRIVCFGR2_PRIV82_Pos     (18U)
#define RISC_PRIVCFGR2_PRIV82_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV82_Pos)       /*!< 0x00040000 */
#define RISC_PRIVCFGR2_PRIV82         RISC_PRIVCFGR2_PRIV82_Msk
#define RISC_PRIVCFGR2_PRIV83_Pos     (19U)
#define RISC_PRIVCFGR2_PRIV83_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV83_Pos)       /*!< 0x00080000 */
#define RISC_PRIVCFGR2_PRIV83         RISC_PRIVCFGR2_PRIV83_Msk
#define RISC_PRIVCFGR2_PRIV84_Pos     (20U)
#define RISC_PRIVCFGR2_PRIV84_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV84_Pos)       /*!< 0x00100000 */
#define RISC_PRIVCFGR2_PRIV84         RISC_PRIVCFGR2_PRIV84_Msk
#define RISC_PRIVCFGR2_PRIV85_Pos     (21U)
#define RISC_PRIVCFGR2_PRIV85_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV85_Pos)       /*!< 0x00200000 */
#define RISC_PRIVCFGR2_PRIV85         RISC_PRIVCFGR2_PRIV85_Msk
#define RISC_PRIVCFGR2_PRIV86_Pos     (22U)
#define RISC_PRIVCFGR2_PRIV86_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV86_Pos)       /*!< 0x00400000 */
#define RISC_PRIVCFGR2_PRIV86         RISC_PRIVCFGR2_PRIV86_Msk
#define RISC_PRIVCFGR2_PRIV87_Pos     (23U)
#define RISC_PRIVCFGR2_PRIV87_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV87_Pos)       /*!< 0x00800000 */
#define RISC_PRIVCFGR2_PRIV87         RISC_PRIVCFGR2_PRIV87_Msk
#define RISC_PRIVCFGR2_PRIV88_Pos     (24U)
#define RISC_PRIVCFGR2_PRIV88_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV88_Pos)       /*!< 0x01000000 */
#define RISC_PRIVCFGR2_PRIV88         RISC_PRIVCFGR2_PRIV88_Msk
#define RISC_PRIVCFGR2_PRIV89_Pos     (25U)
#define RISC_PRIVCFGR2_PRIV89_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV89_Pos)       /*!< 0x02000000 */
#define RISC_PRIVCFGR2_PRIV89         RISC_PRIVCFGR2_PRIV89_Msk
#define RISC_PRIVCFGR2_PRIV90_Pos     (26U)
#define RISC_PRIVCFGR2_PRIV90_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV90_Pos)       /*!< 0x04000000 */
#define RISC_PRIVCFGR2_PRIV90         RISC_PRIVCFGR2_PRIV90_Msk
#define RISC_PRIVCFGR2_PRIV91_Pos     (27U)
#define RISC_PRIVCFGR2_PRIV91_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV91_Pos)       /*!< 0x08000000 */
#define RISC_PRIVCFGR2_PRIV91         RISC_PRIVCFGR2_PRIV91_Msk
#define RISC_PRIVCFGR2_PRIV92_Pos     (28U)
#define RISC_PRIVCFGR2_PRIV92_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV92_Pos)       /*!< 0x10000000 */
#define RISC_PRIVCFGR2_PRIV92         RISC_PRIVCFGR2_PRIV92_Msk
#define RISC_PRIVCFGR2_PRIV93_Pos     (29U)
#define RISC_PRIVCFGR2_PRIV93_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV93_Pos)       /*!< 0x20000000 */
#define RISC_PRIVCFGR2_PRIV93         RISC_PRIVCFGR2_PRIV93_Msk
#define RISC_PRIVCFGR2_PRIV94_Pos     (30U)
#define RISC_PRIVCFGR2_PRIV94_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV94_Pos)       /*!< 0x40000000 */
#define RISC_PRIVCFGR2_PRIV94         RISC_PRIVCFGR2_PRIV94_Msk
#define RISC_PRIVCFGR2_PRIV95_Pos     (31U)
#define RISC_PRIVCFGR2_PRIV95_Msk     (0x1UL << RISC_PRIVCFGR2_PRIV95_Pos)       /*!< 0x80000000 */
#define RISC_PRIVCFGR2_PRIV95         RISC_PRIVCFGR2_PRIV95_Msk

/*******************  Bits definition for RISC_PRIVCFGR3 register *************/
#define RISC_PRIVCFGR3_PRIV96_Pos     (0U)
#define RISC_PRIVCFGR3_PRIV96_Msk     (0x1UL << RISC_PRIVCFGR3_PRIV96_Pos)       /*!< 0x00000001 */
#define RISC_PRIVCFGR3_PRIV96         RISC_PRIVCFGR3_PRIV96_Msk
#define RISC_PRIVCFGR3_PRIV97_Pos     (1U)
#define RISC_PRIVCFGR3_PRIV97_Msk     (0x1UL << RISC_PRIVCFGR3_PRIV97_Pos)       /*!< 0x00000002 */
#define RISC_PRIVCFGR3_PRIV97         RISC_PRIVCFGR3_PRIV97_Msk
#define RISC_PRIVCFGR3_PRIV98_Pos     (2U)
#define RISC_PRIVCFGR3_PRIV98_Msk     (0x1UL << RISC_PRIVCFGR3_PRIV98_Pos)       /*!< 0x00000004 */
#define RISC_PRIVCFGR3_PRIV98         RISC_PRIVCFGR3_PRIV98_Msk
#define RISC_PRIVCFGR3_PRIV99_Pos     (3U)
#define RISC_PRIVCFGR3_PRIV99_Msk     (0x1UL << RISC_PRIVCFGR3_PRIV99_Pos)       /*!< 0x00000008 */
#define RISC_PRIVCFGR3_PRIV99         RISC_PRIVCFGR3_PRIV99_Msk
#define RISC_PRIVCFGR3_PRIV100_Pos    (4U)
#define RISC_PRIVCFGR3_PRIV100_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV100_Pos)      /*!< 0x00000010 */
#define RISC_PRIVCFGR3_PRIV100        RISC_PRIVCFGR3_PRIV100_Msk
#define RISC_PRIVCFGR3_PRIV101_Pos    (5U)
#define RISC_PRIVCFGR3_PRIV101_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV101_Pos)      /*!< 0x00000020 */
#define RISC_PRIVCFGR3_PRIV101        RISC_PRIVCFGR3_PRIV101_Msk
#define RISC_PRIVCFGR3_PRIV102_Pos    (6U)
#define RISC_PRIVCFGR3_PRIV102_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV102_Pos)      /*!< 0x00000040 */
#define RISC_PRIVCFGR3_PRIV102        RISC_PRIVCFGR3_PRIV102_Msk
#define RISC_PRIVCFGR3_PRIV103_Pos    (7U)
#define RISC_PRIVCFGR3_PRIV103_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV103_Pos)      /*!< 0x00000080 */
#define RISC_PRIVCFGR3_PRIV103        RISC_PRIVCFGR3_PRIV103_Msk
#define RISC_PRIVCFGR3_PRIV104_Pos    (8U)
#define RISC_PRIVCFGR3_PRIV104_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV104_Pos)      /*!< 0x00000100 */
#define RISC_PRIVCFGR3_PRIV104        RISC_PRIVCFGR3_PRIV104_Msk
#define RISC_PRIVCFGR3_PRIV105_Pos    (9U)
#define RISC_PRIVCFGR3_PRIV105_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV105_Pos)      /*!< 0x00000200 */
#define RISC_PRIVCFGR3_PRIV105        RISC_PRIVCFGR3_PRIV105_Msk
#define RISC_PRIVCFGR3_PRIV106_Pos    (10U)
#define RISC_PRIVCFGR3_PRIV106_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV106_Pos)      /*!< 0x00000400 */
#define RISC_PRIVCFGR3_PRIV106        RISC_PRIVCFGR3_PRIV106_Msk
#define RISC_PRIVCFGR3_PRIV107_Pos    (11U)
#define RISC_PRIVCFGR3_PRIV107_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV107_Pos)      /*!< 0x00000800 */
#define RISC_PRIVCFGR3_PRIV107        RISC_PRIVCFGR3_PRIV107_Msk
#define RISC_PRIVCFGR3_PRIV108_Pos    (12U)
#define RISC_PRIVCFGR3_PRIV108_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV108_Pos)      /*!< 0x00001000 */
#define RISC_PRIVCFGR3_PRIV108        RISC_PRIVCFGR3_PRIV108_Msk
#define RISC_PRIVCFGR3_PRIV109_Pos    (13U)
#define RISC_PRIVCFGR3_PRIV109_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV109_Pos)      /*!< 0x00002000 */
#define RISC_PRIVCFGR3_PRIV109        RISC_PRIVCFGR3_PRIV109_Msk
#define RISC_PRIVCFGR3_PRIV110_Pos    (14U)
#define RISC_PRIVCFGR3_PRIV110_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV110_Pos)      /*!< 0x00004000 */
#define RISC_PRIVCFGR3_PRIV110        RISC_PRIVCFGR3_PRIV110_Msk
#define RISC_PRIVCFGR3_PRIV111_Pos    (15U)
#define RISC_PRIVCFGR3_PRIV111_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV111_Pos)      /*!< 0x00008000 */
#define RISC_PRIVCFGR3_PRIV111        RISC_PRIVCFGR3_PRIV111_Msk
#define RISC_PRIVCFGR3_PRIV112_Pos    (16U)
#define RISC_PRIVCFGR3_PRIV112_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV112_Pos)      /*!< 0x00010000 */
#define RISC_PRIVCFGR3_PRIV112        RISC_PRIVCFGR3_PRIV112_Msk
#define RISC_PRIVCFGR3_PRIV113_Pos    (17U)
#define RISC_PRIVCFGR3_PRIV113_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV113_Pos)      /*!< 0x00020000 */
#define RISC_PRIVCFGR3_PRIV113        RISC_PRIVCFGR3_PRIV113_Msk
#define RISC_PRIVCFGR3_PRIV114_Pos    (18U)
#define RISC_PRIVCFGR3_PRIV114_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV114_Pos)      /*!< 0x00040000 */
#define RISC_PRIVCFGR3_PRIV114        RISC_PRIVCFGR3_PRIV114_Msk
#define RISC_PRIVCFGR3_PRIV115_Pos    (19U)
#define RISC_PRIVCFGR3_PRIV115_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV115_Pos)      /*!< 0x00080000 */
#define RISC_PRIVCFGR3_PRIV115        RISC_PRIVCFGR3_PRIV115_Msk
#define RISC_PRIVCFGR3_PRIV116_Pos    (20U)
#define RISC_PRIVCFGR3_PRIV116_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV116_Pos)      /*!< 0x00100000 */
#define RISC_PRIVCFGR3_PRIV116        RISC_PRIVCFGR3_PRIV116_Msk
#define RISC_PRIVCFGR3_PRIV117_Pos    (21U)
#define RISC_PRIVCFGR3_PRIV117_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV117_Pos)      /*!< 0x00200000 */
#define RISC_PRIVCFGR3_PRIV117        RISC_PRIVCFGR3_PRIV117_Msk
#define RISC_PRIVCFGR3_PRIV118_Pos    (22U)
#define RISC_PRIVCFGR3_PRIV118_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV118_Pos)      /*!< 0x00400000 */
#define RISC_PRIVCFGR3_PRIV118        RISC_PRIVCFGR3_PRIV118_Msk
#define RISC_PRIVCFGR3_PRIV119_Pos    (23U)
#define RISC_PRIVCFGR3_PRIV119_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV119_Pos)      /*!< 0x00800000 */
#define RISC_PRIVCFGR3_PRIV119        RISC_PRIVCFGR3_PRIV119_Msk
#define RISC_PRIVCFGR3_PRIV120_Pos    (24U)
#define RISC_PRIVCFGR3_PRIV120_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV120_Pos)      /*!< 0x01000000 */
#define RISC_PRIVCFGR3_PRIV120        RISC_PRIVCFGR3_PRIV120_Msk
#define RISC_PRIVCFGR3_PRIV121_Pos    (25U)
#define RISC_PRIVCFGR3_PRIV121_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV121_Pos)      /*!< 0x02000000 */
#define RISC_PRIVCFGR3_PRIV121        RISC_PRIVCFGR3_PRIV121_Msk
#define RISC_PRIVCFGR3_PRIV122_Pos    (26U)
#define RISC_PRIVCFGR3_PRIV122_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV122_Pos)      /*!< 0x04000000 */
#define RISC_PRIVCFGR3_PRIV122        RISC_PRIVCFGR3_PRIV122_Msk
#define RISC_PRIVCFGR3_PRIV123_Pos    (27U)
#define RISC_PRIVCFGR3_PRIV123_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV123_Pos)      /*!< 0x08000000 */
#define RISC_PRIVCFGR3_PRIV123        RISC_PRIVCFGR3_PRIV123_Msk
#define RISC_PRIVCFGR3_PRIV124_Pos    (28U)
#define RISC_PRIVCFGR3_PRIV124_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV124_Pos)      /*!< 0x10000000 */
#define RISC_PRIVCFGR3_PRIV124        RISC_PRIVCFGR3_PRIV124_Msk
#define RISC_PRIVCFGR3_PRIV125_Pos    (29U)
#define RISC_PRIVCFGR3_PRIV125_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV125_Pos)      /*!< 0x20000000 */
#define RISC_PRIVCFGR3_PRIV125        RISC_PRIVCFGR3_PRIV125_Msk
#define RISC_PRIVCFGR3_PRIV126_Pos    (30U)
#define RISC_PRIVCFGR3_PRIV126_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV126_Pos)      /*!< 0x40000000 */
#define RISC_PRIVCFGR3_PRIV126        RISC_PRIVCFGR3_PRIV126_Msk
#define RISC_PRIVCFGR3_PRIV127_Pos    (31U)
#define RISC_PRIVCFGR3_PRIV127_Msk    (0x1UL << RISC_PRIVCFGR3_PRIV127_Pos)      /*!< 0x80000000 */
#define RISC_PRIVCFGR3_PRIV127        RISC_PRIVCFGR3_PRIV127_Msk

/*******************  Bits definition for RISC_PRIVCFGR4 register *************/
#define RISC_PRIVCFGR4_PRIV128_Pos    (0U)
#define RISC_PRIVCFGR4_PRIV128_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV128_Pos)      /*!< 0x00000001 */
#define RISC_PRIVCFGR4_PRIV128        RISC_PRIVCFGR4_PRIV128_Msk
#define RISC_PRIVCFGR4_PRIV129_Pos    (1U)
#define RISC_PRIVCFGR4_PRIV129_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV129_Pos)      /*!< 0x00000002 */
#define RISC_PRIVCFGR4_PRIV129        RISC_PRIVCFGR4_PRIV129_Msk
#define RISC_PRIVCFGR4_PRIV130_Pos    (2U)
#define RISC_PRIVCFGR4_PRIV130_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV130_Pos)      /*!< 0x00000004 */
#define RISC_PRIVCFGR4_PRIV130        RISC_PRIVCFGR4_PRIV130_Msk
#define RISC_PRIVCFGR4_PRIV131_Pos    (3U)
#define RISC_PRIVCFGR4_PRIV131_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV131_Pos)      /*!< 0x00000008 */
#define RISC_PRIVCFGR4_PRIV131        RISC_PRIVCFGR4_PRIV131_Msk
#define RISC_PRIVCFGR4_PRIV132_Pos    (4U)
#define RISC_PRIVCFGR4_PRIV132_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV132_Pos)      /*!< 0x00000010 */
#define RISC_PRIVCFGR4_PRIV132        RISC_PRIVCFGR4_PRIV132_Msk
#define RISC_PRIVCFGR4_PRIV133_Pos    (5U)
#define RISC_PRIVCFGR4_PRIV133_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV133_Pos)      /*!< 0x00000020 */
#define RISC_PRIVCFGR4_PRIV133        RISC_PRIVCFGR4_PRIV133_Msk
#define RISC_PRIVCFGR4_PRIV134_Pos    (6U)
#define RISC_PRIVCFGR4_PRIV134_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV134_Pos)      /*!< 0x00000040 */
#define RISC_PRIVCFGR4_PRIV134        RISC_PRIVCFGR4_PRIV134_Msk
#define RISC_PRIVCFGR4_PRIV135_Pos    (7U)
#define RISC_PRIVCFGR4_PRIV135_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV135_Pos)      /*!< 0x00000080 */
#define RISC_PRIVCFGR4_PRIV135        RISC_PRIVCFGR4_PRIV135_Msk
#define RISC_PRIVCFGR4_PRIV136_Pos    (8U)
#define RISC_PRIVCFGR4_PRIV136_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV136_Pos)      /*!< 0x00000100 */
#define RISC_PRIVCFGR4_PRIV136        RISC_PRIVCFGR4_PRIV136_Msk
#define RISC_PRIVCFGR4_PRIV137_Pos    (9U)
#define RISC_PRIVCFGR4_PRIV137_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV137_Pos)      /*!< 0x00000200 */
#define RISC_PRIVCFGR4_PRIV137        RISC_PRIVCFGR4_PRIV137_Msk
#define RISC_PRIVCFGR4_PRIV138_Pos    (10U)
#define RISC_PRIVCFGR4_PRIV138_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV138_Pos)      /*!< 0x00000400 */
#define RISC_PRIVCFGR4_PRIV138        RISC_PRIVCFGR4_PRIV138_Msk
#define RISC_PRIVCFGR4_PRIV139_Pos    (11U)
#define RISC_PRIVCFGR4_PRIV139_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV139_Pos)      /*!< 0x00000800 */
#define RISC_PRIVCFGR4_PRIV139        RISC_PRIVCFGR4_PRIV139_Msk
#define RISC_PRIVCFGR4_PRIV140_Pos    (12U)
#define RISC_PRIVCFGR4_PRIV140_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV140_Pos)      /*!< 0x00001000 */
#define RISC_PRIVCFGR4_PRIV140        RISC_PRIVCFGR4_PRIV140_Msk
#define RISC_PRIVCFGR4_PRIV141_Pos    (13U)
#define RISC_PRIVCFGR4_PRIV141_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV141_Pos)      /*!< 0x00002000 */
#define RISC_PRIVCFGR4_PRIV141        RISC_PRIVCFGR4_PRIV141_Msk
#define RISC_PRIVCFGR4_PRIV142_Pos    (14U)
#define RISC_PRIVCFGR4_PRIV142_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV142_Pos)      /*!< 0x00004000 */
#define RISC_PRIVCFGR4_PRIV142        RISC_PRIVCFGR4_PRIV142_Msk
#define RISC_PRIVCFGR4_PRIV143_Pos    (15U)
#define RISC_PRIVCFGR4_PRIV143_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV143_Pos)      /*!< 0x00008000 */
#define RISC_PRIVCFGR4_PRIV143        RISC_PRIVCFGR4_PRIV143_Msk
#define RISC_PRIVCFGR4_PRIV144_Pos    (16U)
#define RISC_PRIVCFGR4_PRIV144_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV144_Pos)      /*!< 0x00010000 */
#define RISC_PRIVCFGR4_PRIV144        RISC_PRIVCFGR4_PRIV144_Msk
#define RISC_PRIVCFGR4_PRIV145_Pos    (17U)
#define RISC_PRIVCFGR4_PRIV145_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV145_Pos)      /*!< 0x00020000 */
#define RISC_PRIVCFGR4_PRIV145        RISC_PRIVCFGR4_PRIV145_Msk
#define RISC_PRIVCFGR4_PRIV146_Pos    (18U)
#define RISC_PRIVCFGR4_PRIV146_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV146_Pos)      /*!< 0x00040000 */
#define RISC_PRIVCFGR4_PRIV146        RISC_PRIVCFGR4_PRIV146_Msk
#define RISC_PRIVCFGR4_PRIV147_Pos    (19U)
#define RISC_PRIVCFGR4_PRIV147_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV147_Pos)      /*!< 0x00080000 */
#define RISC_PRIVCFGR4_PRIV147        RISC_PRIVCFGR4_PRIV147_Msk
#define RISC_PRIVCFGR4_PRIV148_Pos    (20U)
#define RISC_PRIVCFGR4_PRIV148_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV148_Pos)      /*!< 0x00100000 */
#define RISC_PRIVCFGR4_PRIV148        RISC_PRIVCFGR4_PRIV148_Msk
#define RISC_PRIVCFGR4_PRIV149_Pos    (21U)
#define RISC_PRIVCFGR4_PRIV149_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV149_Pos)      /*!< 0x00200000 */
#define RISC_PRIVCFGR4_PRIV149        RISC_PRIVCFGR4_PRIV149_Msk
#define RISC_PRIVCFGR4_PRIV150_Pos    (22U)
#define RISC_PRIVCFGR4_PRIV150_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV150_Pos)      /*!< 0x00400000 */
#define RISC_PRIVCFGR4_PRIV150        RISC_PRIVCFGR4_PRIV150_Msk
#define RISC_PRIVCFGR4_PRIV151_Pos    (23U)
#define RISC_PRIVCFGR4_PRIV151_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV151_Pos)      /*!< 0x00800000 */
#define RISC_PRIVCFGR4_PRIV151        RISC_PRIVCFGR4_PRIV151_Msk
#define RISC_PRIVCFGR4_PRIV152_Pos    (24U)
#define RISC_PRIVCFGR4_PRIV152_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV152_Pos)      /*!< 0x01000000 */
#define RISC_PRIVCFGR4_PRIV152        RISC_PRIVCFGR4_PRIV152_Msk
#define RISC_PRIVCFGR4_PRIV153_Pos    (25U)
#define RISC_PRIVCFGR4_PRIV153_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV153_Pos)      /*!< 0x02000000 */
#define RISC_PRIVCFGR4_PRIV153        RISC_PRIVCFGR4_PRIV153_Msk
#define RISC_PRIVCFGR4_PRIV154_Pos    (26U)
#define RISC_PRIVCFGR4_PRIV154_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV154_Pos)      /*!< 0x04000000 */
#define RISC_PRIVCFGR4_PRIV154        RISC_PRIVCFGR4_PRIV154_Msk
#define RISC_PRIVCFGR4_PRIV155_Pos    (27U)
#define RISC_PRIVCFGR4_PRIV155_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV155_Pos)      /*!< 0x08000000 */
#define RISC_PRIVCFGR4_PRIV155        RISC_PRIVCFGR4_PRIV155_Msk
#define RISC_PRIVCFGR4_PRIV156_Pos    (28U)
#define RISC_PRIVCFGR4_PRIV156_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV156_Pos)      /*!< 0x10000000 */
#define RISC_PRIVCFGR4_PRIV156        RISC_PRIVCFGR4_PRIV156_Msk
#define RISC_PRIVCFGR4_PRIV157_Pos    (29U)
#define RISC_PRIVCFGR4_PRIV157_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV157_Pos)      /*!< 0x20000000 */
#define RISC_PRIVCFGR4_PRIV157        RISC_PRIVCFGR4_PRIV157_Msk
#define RISC_PRIVCFGR4_PRIV158_Pos    (30U)
#define RISC_PRIVCFGR4_PRIV158_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV158_Pos)      /*!< 0x40000000 */
#define RISC_PRIVCFGR4_PRIV158        RISC_PRIVCFGR4_PRIV158_Msk
#define RISC_PRIVCFGR4_PRIV159_Pos    (31U)
#define RISC_PRIVCFGR4_PRIV159_Msk    (0x1UL << RISC_PRIVCFGR4_PRIV159_Pos)      /*!< 0x80000000 */
#define RISC_PRIVCFGR4_PRIV159        RISC_PRIVCFGR4_PRIV159_Msk

