STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp211fxx_cm33.h
/************  Bit definition for SYSCFG_USB2PHY2TRIM1CR register  ************/
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Pos                   (0U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Msk                   (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Pos)                     /*!< 0x00000003 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE                       SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLITUNE_Msk                               /*!< PLL integral path tune */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Pos                   (2U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Msk                   (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Pos)                     /*!< 0x0000003C */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE                       SYSCFG_USB2PHY2TRIM1CR_USB2PHY2PLLPTUNE_Msk                               /*!< PLL proportional path tune */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Pos                (6U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Msk                (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Pos)                  /*!< 0x000001C0 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE                    SYSCFG_USB2PHY2TRIM1CR_USB2PHY2COMPDISTUNE_Msk                            /*!< Disconnect threshold adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Pos                   (9U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Msk                   (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Pos)                     /*!< 0x00000E00 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE                       SYSCFG_USB2PHY2TRIM1CR_USB2PHY2SQRXTUNE_Msk                               /*!< Squelch threshold adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Pos                (12U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Msk                (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Pos)                  /*!< 0x00003000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE                    SYSCFG_USB2PHY2TRIM1CR_USB2PHY2VDATREFTUNE_Msk                            /*!< Data detect voltage adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Pos                    (14U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Msk                    (0x7UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Pos)                      /*!< 0x0001C000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE                        SYSCFG_USB2PHY2TRIM1CR_USB2PHY2OTGTUNE_Msk                                /*!< VBUS valid threshold adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Pos                 (17U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Msk                 (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Pos)                   /*!< 0x00060000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE                     SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXHSXVTUNE_Msk                             /*!< Transmitter HS crossover adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Pos                 (19U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Msk                 (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Pos)                   /*!< 0x00780000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE                     SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXFSLSTUNE_Msk                             /*!< Full-speed (FS)/low-speed (LS) source impedance adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Pos                 (23U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Msk                 (0xFUL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Pos)                   /*!< 0x07800000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE                     SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXVREFTUNE_Msk                             /*!< HS DC voltage level adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Pos                 (27U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Msk                 (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Pos)                   /*!< 0x18000000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE                     SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRISETUNE_Msk                             /*!< HS transmitter rise/fall time adjustment */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Pos                  (29U)
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Msk                  (0x3UL << SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Pos)                    /*!< 0x60000000 */
#define SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE                      SYSCFG_USB2PHY2TRIM1CR_USB2PHY2TXRESTUNE_Msk                              /*!< USB source impedance adjustment */

/************  Bit definition for SYSCFG_USB2PHY2TRIM2CR register  ************/
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Pos            (0U)
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Msk            (0x3UL << SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Pos)              /*!< 0x00000003 */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE                SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPAMPTUNE_Msk                        /*!< HS transmitter preemphasis current control */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Pos          (2U)
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Msk          (0x1UL << SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Pos)            /*!< 0x00000004 */
#define SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE              SYSCFG_USB2PHY2TRIM2CR_USB2PHY2TXPREEMPPULSETUNE_Msk                      /*!< HS transmitter preemphasis duration control */

/****************  Bit definition for SYSCFG_OTGARCR register  ****************/
#define SYSCFG_OTGARCR_AREN_Pos                                       (0U)
#define SYSCFG_OTGARCR_AREN_Msk                                       (0x1UL << SYSCFG_OTGARCR_AREN_Pos)                                         /*!< 0x00000001 */
#define SYSCFG_OTGARCR_AREN                                           SYSCFG_OTGARCR_AREN_Msk                                                   /*!< Address remapping enable */

/**************  Bit definition for SYSCFG_OCTOSPIAMCR register  **************/
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Pos                (0U)
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Msk                (0x7UL << SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Pos)                  /*!< 0x00000007 */
#define SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING                    SYSCFG_OCTOSPIAMCR_OCTOSPI_ADDRESS_MAPPING_Msk                            /*!< OCTOSPI1 and OCTOSPI2 address mapping */

/****************  Bit definition for SYSCFG_ETH1CR register  *****************/
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Pos                            (0U)
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Msk                            (0x1UL << SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Pos)                              /*!< 0x00000001 */
#define SYSCFG_ETH1CR_ETH1_REF_CLK_SEL                                SYSCFG_ETH1CR_ETH1_REF_CLK_SEL_Msk                                        /*!< Ethernet reference/RX clock selection */
#define SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos                                (1U)
#define SYSCFG_ETH1CR_ETH1_CLK_SEL_Msk                                (0x1UL << SYSCFG_ETH1CR_ETH1_CLK_SEL_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_ETH1CR_ETH1_CLK_SEL                                    SYSCFG_ETH1CR_ETH1_CLK_SEL_Msk                                            /*!< RGMII 125 MHz clock selection */
#define SYSCFG_ETH1CR_ETH1_SEL_Pos                                    (4U)
#define SYSCFG_ETH1CR_ETH1_SEL_Msk                                    (0x7UL << SYSCFG_ETH1CR_ETH1_SEL_Pos)                                      /*!< 0x00000070 */
#define SYSCFG_ETH1CR_ETH1_SEL                                        SYSCFG_ETH1CR_ETH1_SEL_Msk                                                /*!< Ethernet 1 PHY interface selection */

/****************  Bit definition for SYSCFG_ETH1SR register  *****************/
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Pos                     (0U)
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Msk                     (0x1UL << SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Pos)                       /*!< 0x00000001 */
#define SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL                         SYSCFG_ETH1SR_ETH1_TX_CLK_GATING_CTRL_Msk                                 /*!< Asserted when the MAC has entered Tx LPI mode */
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Pos                           (1U)
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Msk                           (0x1UL << SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Pos)                             /*!< 0x00000002 */
#define SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK                               SYSCFG_ETH1SR_ETH1_PWR_DOWN_ACK_Msk                                       /*!< Asserted when the power-down sequence start has been acknowledged */

/****************  Bit definition for SYSCFG_ETH2CR register  *****************/
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Pos                            (0U)
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Msk                            (0x1UL << SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Pos)                              /*!< 0x00000001 */
#define SYSCFG_ETH2CR_ETH2_REF_CLK_SEL                                SYSCFG_ETH2CR_ETH2_REF_CLK_SEL_Msk                                        /*!< Reference/RX clock selection */
#define SYSCFG_ETH2CR_ETH2_CLK_SEL_Pos                                (1U)
#define SYSCFG_ETH2CR_ETH2_CLK_SEL_Msk                                (0x1UL << SYSCFG_ETH2CR_ETH2_CLK_SEL_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_ETH2CR_ETH2_CLK_SEL                                    SYSCFG_ETH2CR_ETH2_CLK_SEL_Msk                                            /*!< RGMII 125MHz clock selection */
#define SYSCFG_ETH2CR_ETH2_SEL_Pos                                    (4U)
#define SYSCFG_ETH2CR_ETH2_SEL_Msk                                    (0x7UL << SYSCFG_ETH2CR_ETH2_SEL_Pos)                                      /*!< 0x00000070 */
#define SYSCFG_ETH2CR_ETH2_SEL                                        SYSCFG_ETH2CR_ETH2_SEL_Msk                                                /*!< Ethernet 2 PHY interface selection */

/****************  Bit definition for SYSCFG_ETH2SR register  *****************/
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Pos                     (0U)
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Msk                     (0x1UL << SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Pos)                       /*!< 0x00000001 */
#define SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL                         SYSCFG_ETH2SR_ETH2_TX_CLK_GATING_CTRL_Msk                                 /*!< Asserted when the MAC has entered Tx LPI mode */
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Pos                           (1U)
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Msk                           (0x1UL << SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Pos)                             /*!< 0x00000002 */
#define SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK                               SYSCFG_ETH2SR_ETH2_PWR_DOWN_ACK_Msk                                       /*!< Asserted when the power-down sequence start has been acknowledged */

/**************  Bit definition for SYSCFG_VDDIO3CCCR register  ***************/
#define SYSCFG_VDDIO3CCCR_RANSRC_Pos                                  (0U)
#define SYSCFG_VDDIO3CCCR_RANSRC_Msk                                  (0xFUL << SYSCFG_VDDIO3CCCR_RANSRC_Pos)                                    /*!< 0x0000000F */
#define SYSCFG_VDDIO3CCCR_RANSRC                                      SYSCFG_VDDIO3CCCR_RANSRC_Msk                                              /*!< NMOS compensation code of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCCR_RAPSRC_Pos                                  (4U)
#define SYSCFG_VDDIO3CCCR_RAPSRC_Msk                                  (0xFUL << SYSCFG_VDDIO3CCCR_RAPSRC_Pos)                                    /*!< 0x000000F0 */
#define SYSCFG_VDDIO3CCCR_RAPSRC                                      SYSCFG_VDDIO3CCCR_RAPSRC_Msk                                              /*!< PMOS compensation code of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCCR_EN_Pos                                      (8U)
#define SYSCFG_VDDIO3CCCR_EN_Msk                                      (0x1UL << SYSCFG_VDDIO3CCCR_EN_Pos)                                        /*!< 0x00000100 */
#define SYSCFG_VDDIO3CCCR_EN                                          SYSCFG_VDDIO3CCCR_EN_Msk                                                  /*!< I/Os supplied by VDDIO3 compensation cell enable */
#define SYSCFG_VDDIO3CCCR_CS_Pos                                      (9U)
#define SYSCFG_VDDIO3CCCR_CS_Msk                                      (0x1UL << SYSCFG_VDDIO3CCCR_CS_Pos)                                        /*!< 0x00000200 */
#define SYSCFG_VDDIO3CCCR_CS                                          SYSCFG_VDDIO3CCCR_CS_Msk                                                  /*!< I/Os supplied by VDDIO3 code selection */
#define SYSCFG_VDDIO3CCCR_LPMDIS_Pos                                  (10U)
#define SYSCFG_VDDIO3CCCR_LPMDIS_Msk                                  (0x1UL << SYSCFG_VDDIO3CCCR_LPMDIS_Pos)                                    /*!< 0x00000400 */
#define SYSCFG_VDDIO3CCCR_LPMDIS                                      SYSCFG_VDDIO3CCCR_LPMDIS_Msk                                              /*!< VDDIO3 I/Os Compensation cell low power mode disable */

/**************  Bit definition for SYSCFG_VDDIO3CCSR register  ***************/
#define SYSCFG_VDDIO3CCSR_ANSRC_Pos                                   (0U)
#define SYSCFG_VDDIO3CCSR_ANSRC_Msk                                   (0xFUL << SYSCFG_VDDIO3CCSR_ANSRC_Pos)                                     /*!< 0x0000000F */
#define SYSCFG_VDDIO3CCSR_ANSRC                                       SYSCFG_VDDIO3CCSR_ANSRC_Msk                                               /*!< NMOS compensation value of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCSR_APSRC_Pos                                   (4U)
#define SYSCFG_VDDIO3CCSR_APSRC_Msk                                   (0xFUL << SYSCFG_VDDIO3CCSR_APSRC_Pos)                                     /*!< 0x000000F0 */
#define SYSCFG_VDDIO3CCSR_APSRC                                       SYSCFG_VDDIO3CCSR_APSRC_Msk                                               /*!< PMOS compensation value of the I/Os supplied by VDDIO3 */
#define SYSCFG_VDDIO3CCSR_READY_Pos                                   (8U)
#define SYSCFG_VDDIO3CCSR_READY_Msk                                   (0x1UL << SYSCFG_VDDIO3CCSR_READY_Pos)                                     /*!< 0x00000100 */
#define SYSCFG_VDDIO3CCSR_READY                                       SYSCFG_VDDIO3CCSR_READY_Msk                                               /*!< VDDIO3 I/O compensation cell ready flag */

/**************  Bit definition for SYSCFG_VDDIO4CCCR register  ***************/
#define SYSCFG_VDDIO4CCCR_RANSRC_Pos                                  (0U)
#define SYSCFG_VDDIO4CCCR_RANSRC_Msk                                  (0xFUL << SYSCFG_VDDIO4CCCR_RANSRC_Pos)                                    /*!< 0x0000000F */
#define SYSCFG_VDDIO4CCCR_RANSRC                                      SYSCFG_VDDIO4CCCR_RANSRC_Msk                                              /*!< NMOS compensation code of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCCR_RAPSRC_Pos                                  (4U)
#define SYSCFG_VDDIO4CCCR_RAPSRC_Msk                                  (0xFUL << SYSCFG_VDDIO4CCCR_RAPSRC_Pos)                                    /*!< 0x000000F0 */
#define SYSCFG_VDDIO4CCCR_RAPSRC                                      SYSCFG_VDDIO4CCCR_RAPSRC_Msk                                              /*!< PMOS compensation code of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCCR_EN_Pos                                      (8U)
#define SYSCFG_VDDIO4CCCR_EN_Msk                                      (0x1UL << SYSCFG_VDDIO4CCCR_EN_Pos)                                        /*!< 0x00000100 */
#define SYSCFG_VDDIO4CCCR_EN                                          SYSCFG_VDDIO4CCCR_EN_Msk                                                  /*!< VDDIO4 I/O compensation cell enable */
#define SYSCFG_VDDIO4CCCR_CS_Pos                                      (9U)
#define SYSCFG_VDDIO4CCCR_CS_Msk                                      (0x1UL << SYSCFG_VDDIO4CCCR_CS_Pos)                                        /*!< 0x00000200 */
#define SYSCFG_VDDIO4CCCR_CS                                          SYSCFG_VDDIO4CCCR_CS_Msk                                                  /*!< VDDIO4 I/O code selection */
#define SYSCFG_VDDIO4CCCR_LPMDIS_Pos                                  (10U)
#define SYSCFG_VDDIO4CCCR_LPMDIS_Msk                                  (0x1UL << SYSCFG_VDDIO4CCCR_LPMDIS_Pos)                                    /*!< 0x00000400 */
#define SYSCFG_VDDIO4CCCR_LPMDIS                                      SYSCFG_VDDIO4CCCR_LPMDIS_Msk                                              /*!< VDDIO4 I/Os Compensation cell low power mode disable */

/**************  Bit definition for SYSCFG_VDDIO4CCSR register  ***************/
#define SYSCFG_VDDIO4CCSR_ANSRC_Pos                                   (0U)
#define SYSCFG_VDDIO4CCSR_ANSRC_Msk                                   (0xFUL << SYSCFG_VDDIO4CCSR_ANSRC_Pos)                                     /*!< 0x0000000F */
#define SYSCFG_VDDIO4CCSR_ANSRC                                       SYSCFG_VDDIO4CCSR_ANSRC_Msk                                               /*!< NMOS compensation value of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCSR_APSRC_Pos                                   (4U)
#define SYSCFG_VDDIO4CCSR_APSRC_Msk                                   (0xFUL << SYSCFG_VDDIO4CCSR_APSRC_Pos)                                     /*!< 0x000000F0 */
#define SYSCFG_VDDIO4CCSR_APSRC                                       SYSCFG_VDDIO4CCSR_APSRC_Msk                                               /*!< PMOS compensation value of the I/Os supplied by VDDIO4 */
#define SYSCFG_VDDIO4CCSR_READY_Pos                                   (8U)
#define SYSCFG_VDDIO4CCSR_READY_Msk                                   (0x1UL << SYSCFG_VDDIO4CCSR_READY_Pos)                                     /*!< 0x00000100 */
#define SYSCFG_VDDIO4CCSR_READY                                       SYSCFG_VDDIO4CCSR_READY_Msk                                               /*!< VDDIO4 I/O compensation cell ready flag */

